mistyk/inavradar-ESP32/src/main.cpp
#include <Arduino.h>
#include <esp_system.h>
#include <lib/MSP.h>
#include <lib/LoRa.h>
#include <SSD1306.h>
#include <EEPROM.h>
#include <main.h>
#include <inavradarlogo.h>
#include <math.h>
#include <cmath>

// -------- VARS

SSD1306 display(0x3c, 4, 15);

config_t cfg;
system_t sys;
stats_t stats;
MSP msp;

msp_radar_pos_t radarPos;

curr_t curr;
peer_t peers[LORA_NODES_MAX];

air_type0_t air_0;
air_type1_t air_1;
air_type2_t air_2;
air_type3_t air_3;

air_type1_t * air_r1;
air_type2_t * air_r2;
air_type3_t * air_r3;

// -------- SYSTEM

void set_mode(uint8_t mode) {

    switch (mode) {

    case 0 : // SF9 250
        cfg.lora_frequency = 433E6; // 433E6, 868E6, 915E6
        cfg.lora_bandwidth = 250000;
        cfg.lora_coding_rate = 5;
        cfg.lora_spreading_factor = 9;
        cfg.lora_power = 20;
        cfg.lora_slot_spacing = 125;
        cfg.lora_nodes_max = LORA_NODES_MAX;
        cfg.lora_cycle = cfg.lora_nodes_max * cfg.lora_slot_spacing;
        cfg.lora_timing_delay = -60;
        cfg.lora_antidrift_threshold = 5;
        cfg.lora_antidrift_correction = 5;
        cfg.lora_peer_timeout = 6000;

//        cfg.lora_air_mode = LORA_NODES_MIN;

        cfg.msp_version = 2;
        cfg.msp_timeout = 100;
        cfg.msp_fc_timeout = 6000;
        cfg.msp_after_tx_delay = 85;

        cfg.cycle_scan = 4000;
        cfg.cycle_display = 250;
        cfg.cycle_stats = 1000;

        break;

    }
}

int count_peers(bool active = 0) {
    int j = 0;
    for (int i = 0; i < LORA_NODES_MAX; i++) {
        if (active == 1) {
            if ((peers[i].id > 0) && !peers[i].lost) {
                j++;
            }
        }
        else {
            if (peers[i].id > 0) {
                j++;
            }
        }
    }
    return j;
}

void reset_peers() {
    sys.now_sec = millis();
    for (int i = 0; i < LORA_NODES_MAX; i++) {
        peers[i].id = 0;
        peers[i].host = 0;
        peers[i].state = 0;
        peers[i].lost = 0;
        peers[i].broadcast = 0;
        peers[i].lq_updated = sys.now_sec;
        peers[i].lq_tick = 0;
        peers[i].lq = 0;
        peers[i].updated = 0;
        peers[i].rssi = 0;
        peers[i].distance = 0;
        peers[i].direction = 0;
        peers[i].relalt = 0;
        strcpy(peers[i].name, "");
    }
}

void pick_id() {
    curr.id = 0;
    for (int i = 0; i < LORA_NODES_MAX; i++) {
        if ((peers[i].id == 0) && (curr.id == 0)) {
            curr.id = i + 1;
        }
    }
}

void resync_tx_slot(int16_t delay) {
    bool startnow = 0;
    for (int i = 0; (i < LORA_NODES_MAX) && (startnow == 0); i++) { // Resync
        if (peers[i].id > 0) {
            sys.lora_next_tx = peers[i].updated + (curr.id - peers[i].id) * cfg.lora_slot_spacing + cfg.lora_cycle + delay;
            startnow = 1;
        }
    }
}

// ----------------------------------------------------------------------------- calc gps distance

double deg2rad(double deg) {
  return (deg * M_PI / 180);
}

double rad2deg(double rad) {
  return (rad * 180 / M_PI);
}

/**
 * Returns the distance between two points on the Earth.
 * Direct translation from http://en.wikipedia.org/wiki/Haversine_formula
 * @param lat1d Latitude of the first point in degrees
 * @param lon1d Longitude of the first point in degrees
 * @param lat2d Latitude of the second point in degrees
 * @param lon2d Longitude of the second point in degrees
 * @return The distance between the two points in meters
 */

double gpsDistanceBetween(double lat1d, double lon1d, double lat2d, double lon2d) {
  double lat1r, lon1r, lat2r, lon2r, u, v;
  lat1r = deg2rad(lat1d);
  lon1r = deg2rad(lon1d);
  lat2r = deg2rad(lat2d);
  lon2r = deg2rad(lon2d);
  u = sin((lat2r - lat1r)/2);
  v = sin((lon2r - lon1r)/2);
  return 2.0 * 6371000 * asin(sqrt(u * u + cos(lat1r) * cos(lat2r) * v * v));
}

/*
double gpsDistanceBetween(double lat1, double long1, double lat2, double long2)
{
  // returns distance in meters between two positions, both specified
  // as signed decimal-degrees latitude and longitude. Uses great-circle
  // distance computation for hypothetical sphere of radius 6372795 meters.
  // Because Earth is no exact sphere, rounding errors may be up to 0.5%.
  // Courtesy of Maarten Lamers
  double delta = radians(long1-long2);
  double sdlong = sin(delta);
  double cdlong = cos(delta);
  lat1 = radians(lat1);
  lat2 = radians(lat2);
  double slat1 = sin(lat1);
  double clat1 = cos(lat1);
  double slat2 = sin(lat2);
  double clat2 = cos(lat2);
  delta = (clat1 * slat2) - (slat1 * clat2 * cdlong);
  delta = sq(delta);
  delta += sq(clat2 * sdlong);
  delta = sqrt(delta);
  double denom = (slat1 * slat2) + (clat1 * clat2 * cdlong);
  delta = atan2(delta, denom);
  return delta * 6372795;
}

*/

double gpsCourseTo(double lat1, double long1, double lat2, double long2)
{
  // returns course in degrees (North=0, West=270) from position 1 to position 2,
  // both specified as signed decimal-degrees latitude and longitude.
  // Because Earth is no exact sphere, calculated course may be off by a tiny fraction.
  // Courtesy of Maarten Lamers
  double dlon = radians(long2-long1);
  lat1 = radians(lat1);
  lat2 = radians(lat2);
  double a1 = sin(dlon) * cos(lat2);
  double a2 = sin(lat1) * cos(lat2) * cos(dlon);
  a2 = cos(lat1) * sin(lat2) - a2;
  a2 = atan2(a1, a2);
  if (a2 < 0.0)
  {
    a2 += TWO_PI;
  }
  return degrees(a2);
}

// -------- LoRa

void lora_send() {

    if (sys.lora_tick % 8 == 0) {

        if (sys.lora_tick % 16 == 0) {
            air_3.id = curr.id;
            air_3.type = 3;
            air_3.vbat = curr.fcanalog.vbat; // 1 to 255 (V x 10)
            air_3.mah = curr.fcanalog.mAhDrawn;
            air_3.rssi = curr.fcanalog.rssi; // 0 to 1023
            air_3.temp1 = 0;
            air_3.temp2 = 0;

            while (!LoRa.beginPacket()) {  }
            LoRa.write((uint8_t*)&air_3, sizeof(air_3));
            LoRa.endPacket(false);
        }
        else {
            air_2.id = curr.id;
            air_2.type = 2;
            air_2.host = curr.host;
            air_2.state = curr.state;
            strncpy(air_2.name, curr.name, LORA_NAME_LENGTH);
            air_2.temp1 = 0;

            while (!LoRa.beginPacket()) {  }
            LoRa.write((uint8_t*)&air_2, sizeof(air_2));
            LoRa.endPacket(false);
            }
    }
    else {

        if (sys.lora_tick % 2 == 0) {
            air_0.id = curr.id;
            air_0.type = 0;
            air_0.lat = curr.gps.lat / 100; // From XX.1234567 to XX.12345
            air_0.lon = curr.gps.lon / 100; // From XX.1234567 to XX.12345
            air_0.alt = curr.gps.alt; // m
            air_0.heading = curr.gps.groundCourse / 10;  // From degres x 10 to degres

            while (!LoRa.beginPacket()) {  }
            LoRa.write((uint8_t*)&air_0, sizeof(air_0));
            LoRa.endPacket(false);
        }
        else {
            air_1.id = curr.id;
            air_1.type = 1;
            air_1.lat = curr.gps.lat / 100; // From XX.1234567 to XX.12345
            air_1.lon = curr.gps.lon / 100; // From XX.1234567 to XX.12345
            air_1.alt = curr.gps.alt; // m
            air_1.speed = curr.gps.groundSpeed / 100; // From cm/s to m/s
            air_1.broadcast = 0;

            while (!LoRa.beginPacket()) {  }
            LoRa.write((uint8_t*)&air_1, sizeof(air_1));
            LoRa.endPacket(false);
        }
    }
}

void lora_receive(int packetSize) {

    if (packetSize == 0) return;

    sys.lora_last_rx = millis();
    sys.lora_last_rx -= (stats.last_tx_duration > 0 ) ? stats.last_tx_duration : 0; // RX time should be the same as TX time

    sys.last_rssi = LoRa.packetRssi();
    sys.ppsc++;

