mistyk/inavradar-ESP32/src/main.cpp
    LoRa.readBytes((uint8_t *)&air_0, packetSize);

    uint8_t id = air_0.id - 1;
    sys.air_last_received_id = air_0.id;
    peers[id].id = sys.air_last_received_id;
    peers[id].lq_tick++;
    peers[id].lost = 0;
    peers[id].updated = sys.lora_last_rx;
    peers[id].rssi = sys.last_rssi;

    if (air_0.type == 0) { // Type 0 packet

        peers[id].gps.lat = air_0.lat * 100; // From XX.12345 to XX.1234500
        peers[id].gps.lon = air_0.lon * 100; // From XX.12345 to XX.1234500
        peers[id].gps.alt = air_0.alt; // m
        peers[id].gps.groundCourse = air_0.heading * 10; // From degres to degres x 10
    }
    else if (air_0.type == 1) { // Type 1 packet

        air_r1 = (air_type1_t*)&air_0;

        peers[id].gps.lat = (*air_r1).lat * 100; // From XX.12345 to XX.1234500
        peers[id].gps.lon = (*air_r1).lon * 100; // From XX.12345 to XX.1234500
        peers[id].gps.alt = (*air_r1).alt; // m
        peers[id].gps.groundSpeed = (*air_r1).speed * 100; // From m/s to cm/s
        peers[id].broadcast = (*air_r1).broadcast;
    }
    else if (air_0.type == 2) { // Type 2 packet

        air_r2 = (air_type2_t*)&air_0;

        peers[id].host = (*air_r2).host;
        peers[id].state = (*air_r2).state;
        strncpy(peers[id].name, (*air_r2).name, LORA_NAME_LENGTH);
        peers[id].name[LORA_NAME_LENGTH] = 0;
    }
    else if (air_0.type == 3) { // Type 3 packet

        air_r3 = (air_type3_t*)&air_0;

        peers[id].fcanalog.vbat = (*air_r3).vbat;
        peers[id].fcanalog.mAhDrawn = (*air_r3).mah;
        peers[id].fcanalog.rssi = (*air_r3).rssi;
    }

    if ((air_0.type == 0 || air_0.type == 1) && peers[id].gps.lat != 0 && peers[id].gps.lon != 0 && peers[id].gps.alt != 0) {  // Save the last known coordinates
        peers[id].gpsrec.lat = peers[id].gps.lat;
        peers[id].gpsrec.lon = peers[id].gps.lon;
        peers[id].gpsrec.alt = peers[id].gps.alt;
        peers[id].gpsrec.groundCourse = peers[id].gps.groundCourse;
        peers[id].gpsrec.groundSpeed = peers[id].gps.groundSpeed;
    }

    sys.num_peers = count_peers();

    if ((sys.air_last_received_id == curr.id) && (sys.phase > MODE_LORA_SYNC) && !sys.lora_no_tx) { // Same slot, conflict
        uint32_t cs1 = peers[id].name[0] + peers[id].name[1] * 26 + peers[id].name[2] * 26 * 26 ;
        uint32_t cs2 = curr.name[0] + curr.name[1] * 26 + curr.name[2] * 26 * 26;
        if (cs1 < cs2) { // Pick another slot
            sprintf(sys.message, "%s", "ID CONFLICT");
            pick_id();
            resync_tx_slot(cfg.lora_timing_delay);
        }
    }
}

void lora_init() {

    SPI.begin(5, 19, 27, 18);
    LoRa.setPins(SS, RST, DI0);

    if (!LoRa.begin(cfg.lora_frequency)) {
        display.drawString (94, 9, "FAIL");
        while (1);
    }

    LoRa.sleep();
    LoRa.setSignalBandwidth(cfg.lora_bandwidth);
    LoRa.setCodingRate4(cfg.lora_coding_rate);
    LoRa.setSpreadingFactor(cfg.lora_spreading_factor);
    LoRa.setTxPower(cfg.lora_power, 1);
    LoRa.setOCP(250);
    LoRa.idle();
    LoRa.onReceive(lora_receive);
    LoRa.enableCrc();
}

// ----------------------------------------------------------------------------- Display

void display_init() {
    pinMode(16, OUTPUT);
    pinMode(2, OUTPUT);
    digitalWrite(16, LOW);
    delay(50);
    digitalWrite(16, HIGH);
    display.init();
    display.flipScreenVertically();
    display.setFont(ArialMT_Plain_10);
    display.setTextAlignment(TEXT_ALIGN_LEFT);
}

void display_draw() {
    display.clear();

    int j = 0;
    int line;

    if (sys.display_page == 0) {

        display.setFont(ArialMT_Plain_24);
        display.setTextAlignment(TEXT_ALIGN_RIGHT);
        display.drawString(26, 11, String(curr.gps.numSat));
        display.drawString(13, 42, String(sys.num_peers_active + 1));
        display.drawString (125, 11, String(peer_slotname[curr.id]));

        display.setFont(ArialMT_Plain_10);

//        display.drawString (83, 44, String(cfg.lora_cycle) + "ms");
//        display.drawString (105, 23, String(cfg.lora_nodes_max));

        display.drawString (126, 29, "_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ");
        display.drawString (107, 44, String(stats.percent_received));
        display.drawString(107, 54, String(sys.last_rssi));

        display.setTextAlignment (TEXT_ALIGN_CENTER);
        display.drawString (64, 0, String(sys.message));

        display.setTextAlignment (TEXT_ALIGN_LEFT);
        display.drawString (55, 12, String(curr.name));
        display.drawString (27, 23, "SAT");
        display.drawString (108, 44, "%E");

        display.drawString(21, 54, String(sys.pps) + "p/s");
        display.drawString (109, 54, "dB");
        display.drawString (55, 23, String(host_name[curr.host]));

        if (sys.air_last_received_id > 0) {
            display.drawString (36 + sys.air_last_received_id * 8, 54, String(peer_slotname[sys.air_last_received_id]));
        }

        display.drawString (15, 44, "Nod/" + String(cfg.lora_nodes_max));

        if (curr.gps.fixType == 1) display.drawString (27, 12, "2D");
        if (curr.gps.fixType == 2) display.drawString (27, 12, "3D");
    }

    else if (sys.display_page == 1) {

        display.setFont (ArialMT_Plain_10);
        display.setTextAlignment (TEXT_ALIGN_LEFT);

        display.drawHorizontalLine(0, 11, 128);

        long pos[LORA_NODES_MAX];
        long diff;

        for (int i = 0; i < LORA_NODES_MAX ; i++) {
            if (peers[i].id > 0 && !peers[i].lost) {
                diff = sys.lora_last_tx - peers[i].updated;
                if (diff > 0 && diff < cfg.lora_cycle) {
                    pos[i] = 128 - round(128 * diff / cfg.lora_cycle);
                }
            }
            else {
                pos[i] = -1;
            }
        }

        int rect_l = stats.last_tx_duration * 128 / cfg.lora_cycle;

        for (int i = 0; i < LORA_NODES_MAX; i++) {

            display.setTextAlignment (TEXT_ALIGN_LEFT);

            if (pos[i] > -1) {
                display.drawRect(pos[i], 0, rect_l, 12);
                display.drawString (pos[i] + 2, 0, String(peer_slotname[peers[i].id]));
            }

            if (peers[i].id > 0 && j < 4) {
            line = j * 9 + 14;

                display.drawString (0, line, String(peer_slotname[peers[i].id]));
                display.drawString (12, line, String(peers[i].name));
                display.drawString (60, line, String(host_name[peers[i].host]));
                display.setTextAlignment (TEXT_ALIGN_RIGHT);

                if (peers[i].lost) { // Peer timed out
                    display.drawString (127, line, "L:" + String((int)((sys.lora_last_tx - peers[i].updated) / 1000)) + "s" );
                }
                else {
                    if (sys.lora_last_tx > peers[i].updated) {
                        display.drawString (119, line, String(sys.lora_last_tx - peers[i].updated));
                        display.drawString (127, line, "-");
                    }
                    else {
                        display.drawString (119, line, String(cfg.lora_cycle + sys.lora_last_tx - peers[i].updated));
                        display.drawString (127, line, "+");

