mistyk/inavradar-ESP32/src/main.cpp
            display.setTextAlignment (TEXT_ALIGN_RIGHT);

        }
        else {
            display.drawString (35, 7, "SLOT IS EMPTY");
        }

    }

    sys.air_last_received_id = 0;
    sys.message[0] = 0;
    display.display();
}

void display_logo() {
    display.drawXbm(0, 0, logo_width_s, logo_height_s, logo_bits_s);
    display.display();
    delay(2000);
    display.clear();
}

// -------- MSP and FC


void msp_get_state() {

    uint32_t planeModes;
    msp.getActiveModes(&planeModes);
    curr.state = bitRead(planeModes, 0);

}

void msp_get_name() {
    msp.request(MSP_NAME, &curr.name, sizeof(curr.name));
    curr.name[6] = '\0';
}

void msp_get_gps() {
    msp.request(MSP_RAW_GPS, &curr.gps, sizeof(curr.gps));
}

void msp_set_fc() {
    char j[5];
    curr.host = HOST_NONE;
    msp.request(MSP_FC_VARIANT, &j, sizeof(j));

    if (strncmp(j, "INAV", 4) == 0) {
        curr.host = HOST_INAV;
    }
    else if (strncmp(j, "BTFL", 4) == 0) {
        curr.host = HOST_BTFL;
    }

    if (curr.host == HOST_INAV || curr.host == HOST_BTFL) {
        msp.request(MSP_FC_VERSION, &curr.fcversion, sizeof(curr.fcversion));
    }
 }

 void msp_get_fcanalog() {
  msp.request(MSP_ANALOG, &curr.fcanalog, sizeof(curr.fcanalog));
}

void msp_send_radar(uint8_t i) {
    radarPos.id = i;
    radarPos.state = peers[i].state;
    radarPos.lat = peers[i].gps.lat; // x 10E7
    radarPos.lon = peers[i].gps.lon; // x 10E7
    radarPos.alt = peers[i].gps.alt * 100; // cm
    radarPos.heading = peers[i].gps.groundCourse / 10; // From ° x 10 to °
    radarPos.speed = peers[i].gps.groundSpeed; // cm/s
    radarPos.lq = peers[i].lq;
    msp.command2(MSP2_COMMON_SET_RADAR_POS , &radarPos, sizeof(radarPos), 0);
//    msp.command(MSP_SET_RADAR_POS , &radarPos, sizeof(radarPos), 0);
}

void msp_send_peers() {
    for (int i = 0; i < LORA_NODES_MAX; i++) {
        if (peers[i].id > 0) {
            msp_send_radar(i);
        }
    }
}

void msp_send_peer(uint8_t peer_id) {
    if (peers[peer_id].id > 0) {
        msp_send_radar(peer_id);
    }
}

// -------- INTERRUPTS

const byte interruptPin = 0;
volatile int interruptCounter = 0;
int numberOfInterrupts = 0;

portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;

void IRAM_ATTR handleInterrupt() {
    portENTER_CRITICAL_ISR(&mux);

    if (sys.io_button_pressed == 0) {
        sys.io_button_pressed = 1;

        if (sys.display_page >= 3 + LORA_NODES_MAX) {
            sys.display_page = 0;
        }
        else {
            sys.display_page++;
        }
        if (sys.num_peers == 0 && sys.display_page == 1)  { // No need for timings graphs when alone
            sys.display_page++;
        }
        sys.io_button_released = millis();
    }
    portEXIT_CRITICAL_ISR(&mux);
}


// ----------------------------- setup

void setup() {

    set_mode(LORA_PERF_MODE);

    display_init();
    display_logo();

    display.drawString(0, 0, "RADAR VERSION");
    display.drawString(90, 0, VERSION);

    lora_init();
    msp.begin(Serial1);
    Serial1.begin(115200, SERIAL_8N1, SERIAL_PIN_RX , SERIAL_PIN_TX);
    reset_peers();

    pinMode(interruptPin, INPUT);
    sys.io_button_pressed = 0;
    attachInterrupt(digitalPinToInterrupt(interruptPin), handleInterrupt, RISING);

    display.drawString (0, 9, "HOST");
    display.display();

    sys.display_updated = 0;
    sys.cycle_scan_begin = millis();

    sys.io_led_blink = 0;

    pinMode(LED, OUTPUT);
    digitalWrite(LED, HIGH);

    curr.host = HOST_NONE;

    sys.phase = MODE_HOST_SCAN;
}

// ----------------------------------------------------------------------------- MAIN LOOP

void loop() {

    sys.now = millis();

// ---------------------- IO BUTTON

    if ((sys.now > sys.io_button_released + 150) && (sys.io_button_pressed == 1)) {
        sys.io_button_pressed = 0;
    }

// ---------------------- HOST SCAN

    if (sys.phase == MODE_HOST_SCAN) {
            if ((sys.now > (sys.cycle_scan_begin + cfg.msp_fc_timeout)) || (curr.host != HOST_NONE)) {  // End of the host scan

            if (curr.host != HOST_NONE) {
                msp_get_name();
            }

            if (curr.name[0] == '\0') {
                for (int i = 0; i < 4; i++) {
                curr.name[i] = (char) random(65, 90);
                curr.name[4] = 0;
                }
            }

            curr.gps.fixType = 0;
            curr.gps.lat = 0;
            curr.gps.lon = 0;
            curr.gps.alt = 0;
            curr.id = 0;
            if (curr.host > 0) {
                display.drawString (35, 9, String(host_name[curr.host]) + " " + String(curr.fcversion.versionMajor) + "."  + String(curr.fcversion.versionMinor) + "." + String(curr.fcversion.versionPatchLevel));
            }
            else {
                display.drawString (35, 9, String(host_name[curr.host]));
            }

            display.drawProgressBar(0, 53, 40, 6, 100);
            display.drawString (0, 18, "SCAN");
            display.display();

            LoRa.sleep();
            LoRa.receive();

            sys.cycle_scan_begin = millis();
            sys.phase = MODE_LORA_INIT;

        } else { // Still scanning
            if ((sys.now > sys.display_updated + cfg.cycle_display / 2) && sys.display_enable) {

                delay(50);
                msp_set_fc();

                display.drawProgressBar(0, 53, 40, 6, 100 * (millis() - sys.cycle_scan_begin) / cfg.msp_fc_timeout);
                display.display();
                sys.display_updated = millis();
            }
        }
    }

// ---------------------- LORA INIT

    if (sys.phase == MODE_LORA_INIT) {
        if (sys.now > (sys.cycle_scan_begin + cfg.cycle_scan)) {  // End of the scan, set the ID then sync

            sys.num_peers = count_peers();

            if (sys.num_peers >= LORA_NODES_MAX || sys.io_button_released > 0) {
                sys.lora_no_tx = 1;
                sys.display_page = 0;
            }
            else {
//                cfg.lora_cycle =  cfg.lora_slot_spacing * cfg.lora_air_mode;
                pick_id();
            }

            sys.phase = MODE_LORA_SYNC;

        } else { // Still scanning
            if ((sys.now > sys.display_updated + cfg.cycle_display / 2) && sys.display_enable) {
                for (int i = 0; i < LORA_NODES_MAX; i++) {
                    if (peers[i].id > 0) {
                        display.drawString(40 + peers[i].id * 8, 18, String(peer_slotname[peers[i].id]));
                    }
                }
                display.drawProgressBar(40, 53, 86, 6, 100 * (millis() - sys.cycle_scan_begin) / cfg.cycle_scan);
                display.display();
                sys.display_updated = millis();
            }
        }
    }

// ---------------------- LORA SYNC

    if (sys.phase == MODE_LORA_SYNC) {

