mistyk/inavradar-ESP32/src/main.cpp
        if (sys.num_peers == 0 || sys.lora_no_tx) { // Alone or no_tx mode, start at will
            sys.lora_next_tx = millis() + cfg.lora_cycle;
            }
        else { // Not alone, sync by slot
            resync_tx_slot(cfg.lora_timing_delay);
        }
        sys.display_updated = sys.lora_next_tx + cfg.lora_cycle - 30;
        sys.stats_updated = sys.lora_next_tx + cfg.lora_cycle - 15;

        sys.pps = 0;
        sys.ppsc = 0;
        sys.num_peers = 0;
        stats.packets_total = 0;
        stats.packets_received = 0;
        stats.percent_received = 0;

        digitalWrite(LED, LOW);

        sys.phase = MODE_LORA_RX;
        }

// ---------------------- LORA RX

    if ((sys.phase == MODE_LORA_RX) && (sys.now > sys.lora_next_tx)) {

        // sys.lora_last_tx = sys.lora_next_tx;

        while (sys.now > sys.lora_next_tx) { // In  case we skipped some beats
            sys.lora_next_tx += cfg.lora_cycle;
        }

        if (sys.lora_no_tx) {
            sprintf(sys.message, "%s", "SILENT MODE (NO TX)");
        }
        else {
            sys.phase = MODE_LORA_TX;
        }

    sys.lora_tick++;

    }

// ---------------------- LORA TX

    if (sys.phase == MODE_LORA_TX) {

        if ((curr.host == HOST_NONE) || (curr.gps.fixType < 1)) {
            curr.gps.lat = 0;
            curr.gps.lon = 0;
            curr.gps.alt = 0;
            curr.gps.groundCourse = 0;
            curr.gps.groundSpeed = 0;
        }

        sys.lora_last_tx = millis();
        lora_send();
        stats.last_tx_duration = millis() - sys.lora_last_tx;

        // Drift correction

        if (curr.id > 1) {
            int prev = curr.id - 2;
            if (peers[prev].id > 0) {
                sys.lora_drift = sys.lora_last_tx - peers[prev].updated - cfg.lora_slot_spacing;

                if ((abs(sys.lora_drift) > cfg.lora_antidrift_threshold) && (abs(sys.lora_drift) < (cfg.lora_slot_spacing * 0.5))) {
                    sys.drift_correction = constrain(sys.lora_drift, -cfg.lora_antidrift_correction, cfg.lora_antidrift_correction);
                    sys.lora_next_tx -= sys.drift_correction;
                    sprintf(sys.message, "%s %3d", "TIMING ADJUST", -sys.drift_correction);
                }
            }
        }

        sys.lora_slot = 0;
        sys.msp_next_cycle = sys.lora_last_tx + cfg.msp_after_tx_delay;

        // Back to RX

        LoRa.sleep();
        LoRa.receive();
        sys.phase = MODE_LORA_RX;
    }

// ---------------------- DISPLAY

    if ((sys.now > sys.display_updated + cfg.cycle_display) && sys.display_enable && (sys.phase > MODE_LORA_SYNC)) {

        stats.timer_begin = millis();
        display_draw();
        stats.last_oled_duration = millis() - stats.timer_begin;
        sys.display_updated = sys.now;
    }

// ---------------------- SERIAL / MSP

    if (sys.now > sys.msp_next_cycle && curr.host != HOST_NONE && sys.phase > MODE_LORA_SYNC && sys.lora_slot < LORA_NODES_MAX) {

        stats.timer_begin = millis();

        if (sys.lora_slot == 0) {

            if (sys.lora_tick % 6 == 0) {
                msp_get_state();
            }

            if ((sys.lora_tick + 1) % 6 == 0) {
                msp_get_fcanalog();
            }

        }

        msp_get_gps(); // GPS > FC > ESP
        msp_send_peer(sys.lora_slot); // ESP > FC > OSD

        stats.last_msp_duration[sys.lora_slot] = millis() - stats.timer_begin;
        sys.msp_next_cycle += cfg.lora_slot_spacing;
        sys.lora_slot++;

    }


// ---------------------- STATISTICS & IO

    if ((sys.now > (cfg.cycle_stats + sys.stats_updated)) && (sys.phase > MODE_LORA_SYNC)) {

        sys.pps = sys.ppsc;
        sys.ppsc = 0;

        // Timed-out peers + LQ

        for (int i = 0; i < LORA_NODES_MAX; i++) {

            if (sys.now > (peers[i].lq_updated +  cfg.lora_cycle * 4)) {
                uint16_t diff = peers[i].updated - peers[i].lq_updated;
                peers[i].lq = constrain(peers[i].lq_tick * 4.4 * cfg.lora_cycle / diff, 0, 4);
                peers[i].lq_updated = sys.now;
                peers[i].lq_tick = 0;
            }

            if (peers[i].id > 0 && ((sys.now - peers[i].updated) > cfg.lora_peer_timeout)) {
                peers[i].lost = 1;
            }

        }

        sys.num_peers_active = count_peers(1);
        stats.packets_total += sys.num_peers_active * cfg.cycle_stats / cfg.lora_cycle;
        stats.packets_received += sys.pps;
        stats.percent_received = (stats.packets_received > 0) ? constrain(100 * stats.packets_received / stats.packets_total, 0 ,100) : 0;

/*
        if (sys.num_peers >= (cfg.lora_air_mode - 1)&& (cfg.lora_air_mode < LORA_NODES_MAX)) {
            cfg.lora_air_mode++;
            sys.lora_next_tx += cfg.lora_slot_spacing ;
            cfg.lora_cycle =  cfg.lora_slot_spacing * cfg.lora_air_mode;
            }
 */

        // Screen management

        if (!curr.state && !sys.display_enable) { // Aircraft is disarmed = Turning on the OLED
            display.displayOn();
            sys.display_enable = 1;
        }

        else if (curr.state && sys.display_enable) { // Aircraft is armed = Turning off the OLED
            display.displayOff();
            sys.display_enable = 0;
        }

    sys.stats_updated = sys.now;
    }


    // LED blinker

    if (sys.lora_tick % 6 == 0) {
        if (sys.num_peers_active > 0) {
            sys.io_led_changestate = millis() + IO_LEDBLINK_DURATION;
            sys.io_led_count = 0;
            sys.io_led_blink = 1;
        }
    }

    if (sys.io_led_blink && millis() > sys.io_led_changestate) {

        sys.io_led_count++;
        sys.io_led_changestate += IO_LEDBLINK_DURATION;

        if (sys.io_led_count % 2 == 0) {
            digitalWrite(LED, LOW);
        }
        else {
            digitalWrite(LED, HIGH);
        }

        if (sys.io_led_count >= sys.num_peers_active * 2) {
            sys.io_led_blink = 0;
        }

    }

}
